kunichiko/X68k-3mode-fdd-adapter/CH32X035/minyasx-v2/src/pcfdd/pcfdd_control.c
#include "pcfdd/pcfdd_control.h"

#include <stdbool.h>
#include <stdlib.h>

#include "ch32fun.h"
#include "greenpak/greenpak_control.h"
#include "ui/ui_control.h"

#define BPS_TIM_PRESCALER_SHIFT 3                         // 実際に取り込む頻度を下げる頻度 (IC1PSCの値。0=1/1, 1=1/2, 2=1/4, 3=1/8)
#define BPS_TIM_PRESCALER (1 << BPS_TIM_PRESCALER_SHIFT)  // 48MHz/(BPS_TIM_PRESCALER) = 4MHz(既定) → 0.25us resolution

#define SCALE (1u << BPS_TIM_PRESCALER_SHIFT)
#define S_LO(x) ((x) * SCALE)
#define S_HI(x) ((x) * SCALE + (SCALE - 1))  // 上側を「その刻みの最終tick」まで広げる

/* --- ドライブ別 DMA バッファ（CCR=CH1CVRは32bit。まずは32bit受け推奨） --- */
#define READ_DATA_CAP_N 1024
static volatile uint32_t cap_buf_ds0[READ_DATA_CAP_N];
static volatile uint32_t cap_buf_ds1[READ_DATA_CAP_N];
static volatile uint32_t* cap_buf_active = cap_buf_ds0; /* 切替用 */

/**
 * PC FDDのMODE SELECT信号を設定し、回転数変更を試みます
 * ただし、rpm_controlの設定が固定になっている場合は変更しません。
 */
void pcfdd_set_rpm_mode_select(drive_status_t* drive, fdd_rpm_mode_t rpm) {
    uint32_t flag = (1 << 0);  // MODE_SELECT_DOSV のビット位置
    bool inverted = drive->mode_select_inverted;

    switch (drive->rpm_control) {
    case FDD_RPM_CONTROL_300:
        rpm = FDD_RPM_300;
        break;
    case FDD_RPM_CONTROL_360:
        rpm = FDD_RPM_360;
        break;
    case FDD_RPM_CONTROL_NONE:
        // NONEの場合は、rpm引数は無視される
        // 回転数制御なしの場合は、ドライブのデフォルト動作に任せるので、MODE_SELECTはディアサートする
        GPIOB->BCR = flag;  // MODE_SELECT_DOSVをクリア
        drive->rpm_setting = FDD_RPM_UNKNOWN;
        return;
    case FDD_RPM_CONTROL_9SCDRV:
    case FDD_RPM_CONTROL_BPS:
        // これらのモードでは、rpm引数がそのまま使われる
        break;
    default:
        // 想定外の値の場合は、変更しない
        return;
    }
    drive->rpm_setting = rpm;
    // MODE_SELECT_DOSV の設定
    if (((rpm == FDD_RPM_300) && !inverted) || ((rpm == FDD_RPM_360) && inverted)) {
        GPIOB->BCR = flag;  // MODE_SELECT_DOSV = 300RPM mode
    } else {
        GPIOB->BSHR = flag;  // MODE_SELECT_DOSV = 360RPM mode
    }
}

// ---- 設定に応じて調整する定数 ----
#define TIMEOUT_US (500000u)  // 500ms
#define UIF_TICK_US (1000u)   // UIF 1ms

// ---- 測定結果：msec 単位（従来踏襲）----
volatile uint32_t index_width[2] = {0, 0};  // [A,B]

// ---- SysTick ベース内部状態 ----
static volatile uint32_t s_last_edge_cycles = 0;  // 前回エッジ SysTick(48MHz)
static volatile uint8_t s_have_prev_edge = 0;     // 初回保護

typedef enum { DRIVE_NONE = -1, DRIVE_A = 0, DRIVE_B = 1 } drive_t;
static volatile drive_t s_current_drive = DRIVE_NONE;

static inline drive_t current_drive_from_gpio(void) {
    const bool ds_a = (GPIOA->INDR & (1 << 0)) != 0;
    const bool ds_b = (GPIOA->INDR & (1 << 1)) != 0;
    if (ds_a && !ds_b) return DRIVE_A;
    if (!ds_a && ds_b) return DRIVE_B;
    // 想定外（両方0 or 両方1）は、前回を維持せず NONE とする
    return DRIVE_NONE;
}

void pcfdd_init(minyasx_context_t* ctx) {
    // PCFDDコントローラの初期化コードをここに追加
    for (int i = 0; i < 2; i++) {
        ctx->drive[i].state = DRIVE_STATE_POWER_OFF;
        ctx->drive[i].eject_masked = false;
        ctx->drive[i].led_blink = false;
        //        ctx->drive[i].rpm_control = FDD_RPM_CONTROL_360;
        ctx->drive[i].rpm_control = FDD_RPM_CONTROL_9SCDRV;
        ctx->drive[i].rpm_setting = FDD_RPM_360;
        ctx->drive[i].rpm_measured = FDD_RPM_UNKNOWN;
        ctx->drive[i].bps_measured = BPS_UNKNOWN;
    }
    //
    // FDのINDEX信号(PA6)の立ち上がり/立ち下がりエッジを検出するために、Timer3 Channel1を使う
    // Timer3は Channel2で BeepのPWM出力でも使っていて、動的にタイムアウト値(ARR)が変更されてしまうので、
    // Indexパルス幅の検出は、SysTick->CNTの値を直接読むことで実現している
    //

    // プリスケーラを設定
    // 48MHzのクロックを 48 で割ることで1µsの分解能にする
    TIM3->PSC = 48 - 1;  // 48MHz/48 = 1/48μs * 48 -> 1µs resolution
    // リロードレジスタはBeepのPWM出力で使うので、ここでは設定しない
    // TIM3->ATRLR = 0;
    TIM3->SWEVGR |= TIM_UG;

    // Timer3 Channel 1を Capture/Compare の CC1に入力し、
    // 立ち下がりエッジを検出する
    // CC1の設定は TIM3->CHCTLR1 の下位8bitで設定できる
    // CC1 Select (CC1S) を 01にし、Channel 1を入力元とする
    TIM3->CHCTLR1 = TIM_CC1S_0;
    TIM3->CHCTLR1 |= TIM_IC1F_0 | TIM_IC1F_1;  // IC1F = 0b0110 (8サンプルのデジタルフィルタをかける)

    // CC1Eで、 CC1を有効にする
    // CC1P を1にすると、CC1は立ち下がりエッジを検出するようになる
    TIM3->CCER = TIM_CC1E | TIM_CC1P;

    // Timer3 のカウンタを有効にする, オートリロードモードを有効にする
    TIM3->CTLR1 = TIM_CEN | TIM_ARPE | TIM_URS;

    // Timer 3の割り込みを有効にする
    NVIC_EnableIRQ(TIM3_IRQn);

    // CC1IEで、 CC1の割り込みを有効にする
    // UIEで、アップデート割り込みを有効にする
    TIM3->DMAINTENR = TIM_CC1IE | TIM_UIE;

    //
    // READ_DATA の信号のエッジからbpsを測定するために、Timer1 Channel1を使う
    //

    TIM1->PSC = 12 - 1;    // 48MHz/(12) = 4MHz -> 0.25μs resolution
    TIM1->ATRLR = 0xffff;  // 16bitカウンタなので最大値をセット
    // Timer1 Channel 1を Capture/Compare の CC1に入力
    // CC1 Select (CC1S) を 01にし、Channel 1を入力元とする
    // 入力キャプチャ: TI1, 分周なし, 軽いデジタルフィルタ
    TIM1->CHCTLR1 = TIM_CC1S_0;
    TIM1->CHCTLR1 |= (BPS_TIM_PRESCALER_SHIFT << 2);  // IC1PSC = BPS_TIM_PRESCALER_SHIFT (DMA転送のプリスケーラを設定して頻度を下げる)
    // TIM1->CHCTLR1 |= TIM_IC1F_0 | TIM_IC1F_1;  // 必要ならデジタルフィルタ

    // CC1Eで、 CC1を有効にする（※起動はDS選択時に行う）
    // CC1P を1にすると、CC1は立ち下がりエッジを検出するようになる
    TIM1->CCER = /*TIM_CC1E |*/ TIM_CC1P;

    /* CC DMA は CCイベントで出す（重要。UEVではなくCCで発火） */
    TIM1->CTLR2 &= ~TIM_CCDS;

    /* DMA1 Channel2を使って、Timer1 Channel1のキャプチャ値をバッファに保存する。
       CCR1は CH1CVR(32bit) にラッチされるので、PSIZE/MSIZE=32bit で受ける */
    DMA1_Channel2->PADDR = (uint32_t)&TIM1->CH1CVR;  // ★ CH1CVR を読む（従来 CHCTLR1 だったのを修正）
    DMA1_Channel2->MADDR = (uint32_t)cap_buf_active;
    DMA1_Channel2->CNTR = READ_DATA_CAP_N;

    DMA1_Channel2->CFGR = (0 * DMA_CFGR2_DIR) /* DIR=0: P->M */
                          | DMA_CFGR2_CIRC    /* CIRC=1       */
                          | DMA_CFGR2_MINC    /* MINC=1       */
                          | DMA_CFGR2_PSIZE_1 /* PSIZE=10b: 32-bit */
                          | DMA_CFGR2_MSIZE_1 /* MSIZE=10b: 32-bit */
                          | DMA_CFGR2_HTIE    /* Half */
                          | DMA_CFGR2_TCIE    /* Full */
        /* | DMA_CFGR2_PL_1 */;               /* 必要に応じて優先度を上げる */

    // まだ開始しない（DSが来たら開始）:
    TIM1->DMAINTENR &= ~TIM_CC1DE;        // CC1 DMA要求停止
    DMA1_Channel2->CFGR &= ~DMA_CFGR2_EN; /* DMA停止 */
    TIM1->CCER &= ~TIM_CC1E;              // 入力キャプチャ停止

    // カウンタ自体は回しておく（どちらでも良い）
    TIM1->CTLR1 |= TIM_CEN;

    // DMA割り込み有効
    NVIC_EnableIRQ(DMA1_Channel2_IRQn);

