kunichiko/X68k-3mode-fdd-adapter/CH32X035/minyasx-v2/src/pcfdd/pcfdd_control.c
/*
  DMA1 Channel2 Global Interrupt Handler
 */
void DMA1_Channel2_IRQHandler(void) __attribute__((interrupt));
void DMA1_Channel2_IRQHandler(void) {
    dma_int_count++;
    uint32_t isr = DMA1->INTFR;

    if (isr & DMA_HTIF2) {
        DMA1->INTFCR = DMA_CHTIF2;
        process_block32(&cap_buf_active[0], READ_DATA_CAP_N / 2);
    }
    if (isr & DMA_TCIF2) {
        DMA1->INTFCR = DMA_CTCIF2;
        process_block32(&cap_buf_active[READ_DATA_CAP_N / 2], READ_DATA_CAP_N / 2);
    }
    if (isr & DMA_TEIF2) {
        DMA1->INTFCR = DMA_CTEIF2;
        // 必要なら再初期化
    }

    // まれにCC1OF対策でINTFR/CVRを読んでフラグ掃除
    (void)TIM1->INTFR;
    (void)TIM1->CH1CVR;
}

// 既存の分類カウンタ（classify_dt() で増やしているもの）
extern volatile uint32_t cnt_7ish, cnt_8ish, cnt_10ish, cnt_13ish, cnt_16ish;
extern volatile uint32_t cnt_other;

// 必要なら数値にしたい時用（表示など）
inline uint32_t fdd_bps_mode_to_value(fdd_bps_mode_t m) {
    switch (m) {
    case BPS_600K:
        return 600000;
    case BPS_500K:
        return 500000;
    case BPS_416K:
        return 416000;  // 416,667に丸めたければ 416667
    case BPS_300K:
        return 300000;
    case BPS_250K:
        return 250000;
    default:
        return 0;
    }
}

static inline fdd_bps_mode_t bin_index_to_mode(int idx) {
    switch (idx) {
    case 0:
        return BPS_600K;  // 7ish
    case 1:
        return BPS_500K;  // 8ish
    case 2:
        return BPS_416K;  // 10ish
    case 3:
        return BPS_300K;  // 13ish
    case 4:
        return BPS_250K;  // 16ish
    default:
        return BPS_UNKNOWN;
    }
}

#define VOTES_MIN 50         /* 有効票の最小数（ギャップや無信号を弾く） */
#define TOP_THRESHOLD_PCT 20 /* 最多ビンの下限比率 */

fdd_bps_mode_t pcfdd_bps_decide_and_reset(int drive) {
    if (drive < 0 || drive > 1) return BPS_UNKNOWN;
    rd_stats_t* S = (rd_stats_t*)&g_stats[drive];

    uint32_t c7 = S->cnt_7ish, c8 = S->cnt_8ish, c10 = S->cnt_10ish, c13 = S->cnt_13ish, c16 = S->cnt_16ish;
    S->cnt_7ish = S->cnt_8ish = S->cnt_10ish = S->cnt_13ish = S->cnt_16ish = S->cnt_other = 0;

    uint32_t votes = c7 + c8 + c10 + c13 + c16;
    ui_cursor(UI_PAGE_DEBUG_PCFDD, 0, 3 + drive * 2);
    ui_printf(UI_PAGE_DEBUG_PCFDD, "%d:%d:%d:%d:%d[%d:%d]\n",  //
              (int)c7 / 10, (int)c8 / 10, (int)c10 / 10, (int)c13 / 10, (int)c16 / 10, (int)S->cnt_other / 10, (int)votes / 10);
    if (votes < VOTES_MIN) return BPS_UNKNOWN;

    uint32_t bins[5] = {c7, c8, c10, c13, c16};
    int top = 0;
    for (int i = 1; i < 5; i++)
        if (bins[i] > bins[top]) top = i;

    if (bins[top] * 100U < votes * TOP_THRESHOLD_PCT) return BPS_UNKNOWN;
    return bin_index_to_mode(top);
}

//
//

static volatile pcfdd_ds_t g_current_ds = PCFDD_DS_NONE;

/* 別モジュールから現在のDRIVE_SELECT状態を通知する */
void pcfdd_set_current_ds(pcfdd_ds_t ds) {
    if (ds == g_current_ds) return;

    /* 一旦止めてから必要なら再開。DS0/DS1→0/1 にマップ */
    capture_pause();
    if (ds == PCFDD_DS0)
        capture_start_for_drive(0);
    else if (ds == PCFDD_DS1)
        capture_start_for_drive(1);

    g_current_ds = ds;
}

//
//
//

void step_dosv(int drive, bool direction_inward) {
    if (drive < 0 || drive > 1) {
        return;
    }
    // GreenPAK4の Vitrual Input に以下を接続している
    // 6 (bit1)  = DIRECTION (正論理)
    // 5 (bit2)  = STEP (正論理)
    // LOCK_ACKがアサートされている間だけ上記信号は有効になるので、
    // LOCKはすでに撮れた状態でこのメソッドを呼ぶこと
    uint8_t gp4_vin = greenpak_get_virtualinput(4 - 1);
    gp4_vin |= (1 << 2);  // bit2 = 1 (STEP = 1)
    if (direction_inward) {
        gp4_vin |= (1 << 1);  // bit1 = 1 (DIRECTION = 1, 内周方向)
    } else {
        gp4_vin &= ~(1 << 1);  // bit1 = 0 (DIRECTION = 0, 外周方向)
    }
    greenpak_set_virtualinput(4 - 1, gp4_vin);
    Delay_Ms(1);
    gp4_vin &= ~(1 << 2);  // bit2 = 0 (STEP = 0)
    greenpak_set_virtualinput(4 - 1, gp4_vin);
    Delay_Ms(3);
}

void drive_select(int drive, bool active) {
    if (drive < 0 || drive > 1) {
        return;
    }
    // GreenPAK1の Virtual Input 5/6 (bit2/1) に DS0/DS1 を接続している
    uint8_t gp1_vin = greenpak_get_virtualinput(1 - 1);
    if (active) {
        gp1_vin |= (1 << (2 - drive));  // bit2/1 = 1 (DS0/DS1 active)
    } else {
        gp1_vin &= ~(1 << (2 - drive));  // bit2/1 = 0 (DS0/DS1 inactive)
    }
    greenpak_set_virtualinput(1 - 1, gp1_vin);
}

bool seek_to_track0(int drive) {
    ui_logf(UI_LOG_LEVEL_INFO, "Seek Track0 (D:%d)\n", drive);
    if (drive < 0 || drive > 1) {
        return false;
    }

    int seek_count = 0;
    // シーク Part1
    drive_select(drive, true);
    for (int i = 0; i < 100; i++) {
        step_dosv(drive, true);  // 内周方向にステップ
    }
    // ここで 100msec待つ(Track00以外でシークを一度確定しないとDISK_CHANGEがクリアされないドライブがある)
    Delay_Ms(10);
    // シーク Part2
    seek_count = 0;
    const int SEEK_COUNT_MAX = 100;
    while (seek_count < SEEK_COUNT_MAX) {
        seek_count++;
        // TRACK0を見て、トラック0に到達したら抜ける
        if ((GPIOB->INDR & (1 << 10)) == 0) {
            // TRACK0_DOSV = 0 (Low) になった
            break;
        }
        step_dosv(drive, false);  // 外周方向にステップ
    }
    Delay_Ms(100);
    drive_select(drive, false);
    Delay_Ms(100);

    ui_logf(UI_LOG_LEVEL_INFO, "  Seeked %d steps\n", seek_count);
    // 戻り値: SEEK_COUNT_MAX ステップ以内にトラック0に到達したらtrue
    return (seek_count < SEEK_COUNT_MAX);
}

uint32_t last_index_ms = 0;
bool last_index_state = false;

/**
 * FDDバスのロックを取得します。
 * LOCK_REQをアサートすると、GP1は DRIVE_SELECT_A/Bが両方ともアクティブじゃないタイミングで
 * LOCK_ACK (PB7)をアサートします。
 * LOCK_ACKがアサートされている間は、READY以外の信号がX68000側に届かなくなります。
 * そうすると、X68000側にはINDEXが届かなくなるので、X68000のFDCはINDEXを待ち続けるため、
 * その隙に　PCFDD側のDrive Selectをアクティブにしても問題なくなります。
 */
static bool get_fdd_lock() {
    GPIOC->BSHR = GPIO_Pin_6;  // LOCK_REQ active (High=アクセス禁止要求)
    uint32_t systick_start = SysTick->CNTL;
    while ((GPIOB->INDR & GPIO_Pin_7) == 0) {
        // LOCK_ACKがアサートされるまで待つ
        // (100msec以上待っても来ない場合は、一旦リターンし次回の呼び出しで再度試みる)
        if ((SysTick->CNTL - systick_start) > (100 * 1000 * 48)) {
            // 100msec以上待ってもLOCK_ACKが来らない場合は失敗
            GPIOC->BCR = GPIO_Pin_6;  // LOCK_REQ inactive
            return false;             // LOCK取得失敗
        }
    }
    // LOCK_ACKがアサートされた(LOCK取得成功)
    return true;
}

