kunichiko/X68k-3mode-fdd-adapter/CH32X035/minyasx-v2/src/pcfdd/pcfdd_control.c
static void release_fdd_lock() {
    GPIOC->BCR = GPIO_Pin_6;  // LOCK_REQ inactive
}

static void process_initializing(minyasx_context_t* ctx, int drive) {
    if (ctx->drive[drive].state != DRIVE_STATE_INITIALIZING) return;
    // 1. LOCK_REQをアサートして、LOCK_ACKがアサートされるまで待つ
    if (!get_fdd_lock()) {
        // LOCK取得失敗 (一旦リターンし次回の呼び出しで再度試みる)
        return;
    }

    // シークしてトラック0に戻す
    if (seek_to_track0(drive)) {
        ctx->drive[drive].state = DRIVE_STATE_MEDIA_DETECTING;
        ctx->drive[drive].rpm_measured = FDD_RPM_UNKNOWN;
        ctx->drive[drive].bps_measured = BPS_UNKNOWN;
    } else {
        // トラック0に戻れなかった =  ドライブが存在しない
        ctx->drive[drive].state = DRIVE_STATE_NOT_CONNECTED;
        ctx->drive[drive].rpm_measured = FDD_RPM_UNKNOWN;
        ctx->drive[drive].bps_measured = BPS_UNKNOWN;
    }

    // ロックを解除する
    release_fdd_lock();
}

static void process_media_detecting(minyasx_context_t* ctx, int drive) {
    if (ctx->drive[drive].state != DRIVE_STATE_MEDIA_DETECTING) return;

    drive_status_t* d = &ctx->drive[drive];

    // 1. LOCK_REQをアサートして、LOCK_ACKがアサートされるまで待つ
    if (!get_fdd_lock()) {
        // LOCK取得失敗 (一旦リターンし次回の呼び出しで再度試みる)
        return;
    }

    // TODO: ここでDRIVE_SELECT_A/Bが両方ともアクティブでないことを確認する

    // 2. TRACK00にシークする
    // これをするとPC FDDの DISK_CHANGEもクリアされる
    seek_to_track0(drive);

    // 3. PC FDD側のDrive Selectをアクティブにし、MOTOR_ONもアクティブにする
    //    GPIOB->BSHR = (1 << (2 + drive));  // Drive Select A/B active
    drive_select(drive, true);
    if ((GPIOB->INDR & (1 << 4)) == 0) {
        uint8_t gp4_in = greenpak_get_virtualinput(4 - 1);
        gp4_in |= (1 << 0);  // bit0 = 1 (MOTOR_ON = 1)
        greenpak_set_virtualinput(4 - 1, gp4_in);
        // モーターの回転が安定するまで 300msec待つ
        Delay_Ms(300);
    }

    // 4. 500msecの間に INDEXパルスが来るかを監視する
    uint32_t systick_start = SysTick->CNTL;
    bool index_low_seen = false;
    bool index_high_seen = false;
    while ((SysTick->CNTL - systick_start) < (500 * 1000 * 48)) {
        uint32_t gpioa = GPIOA->INDR;
        if ((gpioa & (1 << 6)) == 0) {
            // INDEX_DOSV (PA6) = 0 (Low) になった
            index_low_seen = true;
        }
        if ((gpioa & (1 << 6)) != 0) {
            // INDEX_DOSV (PA6) = 1 (High) になった
            index_high_seen = true;
        }
        if (index_low_seen && index_high_seen) {
            break;
        }
    }

    // 5. INDEXパルスの有無で、メディアの有無を判断する
    if (!(index_low_seen && index_high_seen)) {
        // INDEXパルスが来なかった
        // →メディア無しと判断する
        d->state = DRIVE_STATE_NO_MEDIA;
        d->rpm_measured = FDD_RPM_UNKNOWN;
        d->bps_measured = BPS_UNKNOWN;
    } else {
        // INDEXパルスが来た
        // →メディア有りと判断する
        d->state = DRIVE_STATE_READY;
        d->rpm_measured = FDD_RPM_UNKNOWN;
        d->bps_measured = BPS_UNKNOWN;
        uint8_t gp3_vin = greenpak_get_virtualinput(3 - 1);
        gp3_vin &= ~(1 << (5 - drive));  // bit4/5を0にして、DISK_IN_x_nをEnableにする
        greenpak_set_virtualinput(3 - 1, gp3_vin);
    }

    // 6. Drive Selectを非アクティブにし、MOTOR_ONも非アクティブにする
    drive_select(drive, false);

    uint8_t gp4_in = greenpak_get_virtualinput(4 - 1);
    gp4_in &= ~(1 << 0);  // bit0 = 0 (MOTOR_ON_DOSV = 0)
    greenpak_set_virtualinput(4 - 1, gp4_in);

    // 6. ロックを解除する
    release_fdd_lock();

    return;
}

static void process_no_media(minyasx_context_t* ctx, int drive) {
    if (ctx->drive[drive].state != DRIVE_STATE_NO_MEDIA) return;

    // メディア無し状態の処理
    // 1. READY_MCUをInactiveにする
    GPIOB->BSHR = (drive == 0) ? GPIO_Pin_12 : GPIO_Pin_13;  // READY_MCU_A_n / READY_MCU_B_n (High=準備完了でない)
    // 2. GP2,GP3の DISK_IN_x_n をDisableにする
    uint8_t gp2_vin = greenpak_get_virtualinput(2 - 1);
    gp2_vin |= (1 << (5 - drive));  // bit4/5を1にして、DISK_IN_x_nをDisableにする
    greenpak_set_virtualinput(2 - 1, gp2_vin);
    uint8_t gp3_vin = greenpak_get_virtualinput(3 - 1);
    gp3_vin |= (1 << (5 - drive));  // bit4/5を1にして、DISK_IN_x_nをDisableにする
    greenpak_set_virtualinput(3 - 1, gp3_vin);
}

static void process_ready(minyasx_context_t* ctx, int drive) {
    if (ctx->drive[drive].state != DRIVE_STATE_READY) return;

    // READY状態の処理

    // 1. READY_MCUをActiveにする
    // MOTOR ON信号(PA12)がアクティブならREADY信号をアクティブにする
    // GreenPAKは各ドライブにDriveSelect信号がアサートされると、
    // このREADY信号の値を返却します
    if (!(GPIOA->INDR & GPIO_Pin_12)) {
        // MOTOR_ON アクティブ
        GPIOB->BCR = (drive == 0) ? GPIO_Pin_12 : GPIO_Pin_13;  // READY_MCU_A_n / READY_MCU_B_n (Low=準備完了)
    } else {
        GPIOB->BSHR = (drive == 0) ? GPIO_Pin_12 : GPIO_Pin_13;  // READY_MCU_A_n / READY_MCU_B_n (High=準備完了でない)
    }

    // 2. GP2,GP3の DISK_IN_x_n をEnableにする
    uint8_t gp2_vin = greenpak_get_virtualinput(2 - 1);
    gp2_vin &= ~(1 << (5 - drive));  // bit4/5を0にして、DISK_IN_x_nをEnableにする
    greenpak_set_virtualinput(2 - 1, gp2_vin);

    uint8_t gp3_vin = greenpak_get_virtualinput(3 - 1);
    gp3_vin &= ~(1 << (5 - drive));  // bit4/5を0にして、DISK_IN_x_nをEnableにする
    greenpak_set_virtualinput(3 - 1, gp3_vin);
}

void pcfdd_poll(minyasx_context_t* ctx, uint32_t systick_ms) {
    // PCFDDコントローラの定期処理コード
    for (int drive = 0; drive < 2; drive++) {
        switch (ctx->drive[drive].state) {
        case DRIVE_STATE_POWER_OFF:
            break;
        case DRIVE_STATE_INITIALIZING:
            process_initializing(ctx, drive);
            break;
        case DRIVE_STATE_NOT_CONNECTED:
            break;
        case DRIVE_STATE_DISABLED:
            break;
        case DRIVE_STATE_MEDIA_DETECTING:
            process_media_detecting(ctx, drive);
            break;
        case DRIVE_STATE_NO_MEDIA:

            process_no_media(ctx, drive);
            break;
        case DRIVE_STATE_READY:
            process_ready(ctx, drive);
            break;
        default:
            break;
        }
    }

    // DISK_CHANGE_DOSV (PB8) の変化を監視し、変化があったらメディア検出状態に遷移する
#if 0
    static int disk_change_count[2] = {0, 0};
    for (int drive = 0; drive < 2; drive++) {
        drive_status_t* drv = &ctx->drive[drive];
        uint32_t gpiob = GPIOB->INDR;
        bool drive_select = (gpiob & (1 << (2 + drive)));  // Drive Select A/B active?
        bool disk_change = (gpiob & (1 << 8)) == 0;        // DISK_CHANGE_DOSV = 0 (Low) active?
        if (drive_select) {
            if (disk_change) {
                disk_change_count[drive]++;
                if (disk_change_count[drive] >= 3) {
                    // 3回連続でDISK_CHANGEがアサートされている
                    disk_change_count[drive] = 0;
                    ui_printf(UI_PAGE_LOG, "D%d: Disk Chg det\n", drive);
                    if (drv->state == DRIVE_STATE_READY) {
                        // READY状態でDISK_CHANGEがアサートされたらメディア検出状態に遷移する
                        // アクセス中なのでちょっと怖いが……
                        drv->state = DRIVE_STATE_MEDIA_DETECTING;
                    }
                    if (drv->state == DRIVE_STATE_NO_MEDIA) {
                        // NO_MEDIAでDISK_CHANGEがアサートされたらメディア検出状態に遷移する
                        drv->state = DRIVE_STATE_MEDIA_DETECTING;
                    }
                }
            } else {
                disk_change_count[drive] = 0;
            }
        }
    }
#endif
    for (int drive = 0; drive < 2; drive++) {
        drive_status_t* drv = &ctx->drive[drive];
        uint32_t systick_start = SysTick->CNTL;
        bool disk_change_det = true;
        while ((SysTick->CNTL - systick_start) < (10 * 1000 * 48)) {  // 10msec継続しているか
            uint32_t gpiob = GPIOB->INDR;
            bool drive_select = (gpiob & (1 << (2 + drive)));  // Drive Select A/B active?
            bool disk_change = (gpiob & (1 << 8)) == 0;        // DISK_CHANGE_DOSV = 0 (Low) active?
            if (!drive_select || !disk_change) {
                disk_change_det = false;
                break;
            }
        }
        if (disk_change_det) {
            ui_printf(UI_PAGE_LOG, "Disk Chg det %1d\n", drive);
            if (drv->state == DRIVE_STATE_READY) {
                // READY状態でDISK_CHANGEがアサートされたらメディア検出状態に遷移する
                // アクセス中なのでちょっと怖いが……
                drv->state = DRIVE_STATE_MEDIA_DETECTING;
            }
            if (drv->state == DRIVE_STATE_NO_MEDIA) {
                // NO_MEDIAでDISK_CHANGEがアサートされたらメディア検出状態に遷移する
                drv->state = DRIVE_STATE_MEDIA_DETECTING;
            }
        }
    }

    // RPMとBPSの計測を1秒毎に行う
    static uint64_t last_tick = 0;
    if (systick_ms - last_tick < 1000) {
        return;
    }
    last_tick = systick_ms;

